index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-06-15 Mon 22:48 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Payment for Order Flow</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Matt Brigida, Ph.D." />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Payment for Order Flow</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org6c7f547">1. Payment for Order Flow</a></li>
<li><a href="#org1c13cc0">2. Is All Order Flow Worth The Same?</a></li>
<li><a href="#orgfc0f15c">3. The Broad Effect on Financial Markets</a></li>
<li><a href="#orgf643c83">4. Recent Cases Involving Payment for Order Flow</a></li>
<li><a href="#org29b7982">5. Reading Ease Score</a></li>
</ul>
</div>
</div>
<p>
<a href="https://www.youtube.com/watch?v=1sOqYRdnP_g">The Only Game in Town</a> illustrated how the financial industry profits from liquidity and noise traders, and loses to informed traders.  Since the amount of liquidity trading is fixed, the industry attempts to increase the number of noise traders. Noise traders are those who think they are informed, but are really not. The more a noise traders trades, the more they are guaranteed to lose to the market maker through the bid/ask spread.  This discussion treats the financial industry as a whole, but here we'll look at the issue from the perspective of an individual institution.
</p>

<div id="outline-container-org6c7f547" class="outline-2">
<h2 id="org6c7f547"><span class="section-number-2">1</span> Payment for Order Flow</h2>
<div class="outline-text-2" id="text-1">
<p>
Now take a particular point in time, and the amount of noise trading is fixed.  How can our individual financial institution increase their share of noise trading, without also increasing their exposure to informed traders?  Our institution can't simple make markets in more stocks or offer tighter spreads, which will increase market share of both noise and informed.  We need some way to specifically target noise traders.
</p>

<p>
The first observation to make is that small retail traders are nearly all (if not completely) noise traders.  If we wait for these traders' orders to reach the exchange, we can only estimate who is a small retail trader&#x2014;informed traders will actively try to disguise themselves as these noise traders.
</p>

<p>
So we need to get the small retail traders order flow <i>before</i> is reaches the exchange.  This is where <i>Payment for Order Flow</i> comes in.  Say a particular brokerage firm, call it Millennial Inc, has customers who are primarily small retail traders who are new to financial markets.  We pay Millennial $100 million per year for Millennial to send their customers orders to our firm, where we can wither fill those orders or, if not, send them along to organized exchanges.
</p>

<p>
We cannot give the customers of Millennial <i>worse</i> fill prices than what is available in the exchanges, but the key to understand is we don't need to. Spreads are increasing in the proportion of informed trading.  So if the order flow we have bought has fewer informed traders, we can meet or beat the spreads offered in the market and be <i>more</i> profitable because we are not losing to the informed.  
</p>

<p>
So a rough calculation may look like this, if Millennial has $500 billion in order flow per year, and the average spread is 0.01%, then our firm expects to earn $500 billion times 0.01% which is $500 million per year.  After paying Millennial we have an expected profit of $400 million.
</p>
</div>
</div>

<div id="outline-container-org1c13cc0" class="outline-2">
<h2 id="org1c13cc0"><span class="section-number-2">2</span> Is All Order Flow Worth The Same?</h2>
<div class="outline-text-2" id="text-2">
<p>
Say GenX is a brokerage catering to mid-career professionals who are primarily liquidity traders.  Conversely, Millennial caters to younger early-career clients who are primarily active noise traders.  Would you pay the same amount per unit of order flow (say per trade)?
</p>

<p>
No, you would pay more for the GenX order flow than Millennial.  The idea is GenX is safer&#x2014;the order flow is less affected by the state of the economy.  Millennial order flow will increase if the stock market increases, and will decrease sharply if there is a crash.  So you should play less for this order flow, which will give you a higher expected return.
</p>

<p>
Note, the market maker earns an equal amount from the liquidity trader as from the noise trader.  The riskiness of the noise trader order flow comes from its correlation with the economy.  You can say noise trader order flow has a higher \(\beta\) and therefore a higher expected return.
</p>
</div>
</div>

<div id="outline-container-orgfc0f15c" class="outline-2">
<h2 id="orgfc0f15c"><span class="section-number-2">3</span> The Broad Effect on Financial Markets</h2>
<div class="outline-text-2" id="text-3">
<p>
The concern is that if much of the profitable noise trader order flow never makes it to the National Market System (organized exchanges) then there will be a larger proportion of informed traders in these markets.  Market makers will thus increase spreads, driving out all but the informed traders.  Once the market is dominated by the informed, it fails.
</p>

<p>
The systemic effect of payment for order flow is a concern for policymakers and regulators&#x2014;not shareholder-value-maximizing market participants. Academic research on the topic, like most research, has provided mixed results.  If you are interested in reading the academic literature on the topic, I would recommend you start with <a href="https://scholar.google.com/scholar?cluster=5963764566755566857&amp;hl=en&amp;as_sdt=0,33">Easley, Kiefer and O'Hara (1996)</a>.
</p>
</div>
</div>

<div id="outline-container-orgf643c83" class="outline-2">
<h2 id="orgf643c83"><span class="section-number-2">4</span> Recent Cases Involving Payment for Order Flow</h2>
<div class="outline-text-2" id="text-4">
<p>
<a href="https://www.bloomberg.com/news/articles/2019-12-19/robinhood-fined-1-25-million-over-how-it-routed-customer-orders">Robinhood was fined $1.25 million in 2019 because it didn't ensure the best price for its customers.</a>  <a href="https://www.finra.org/media-center/newsreleases/2019/finra-fines-robinhood-financial-llc-125-million-best-execution">Here is the FINRA announcement.</a>  Robinhood apparently <a href="https://www.bloomberg.com/news/articles/2018-10-15/robinhood-gets-almost-half-its-revenue-in-controversial-bargain-with-high-speed-traders">gets much of its revenue from payment for order flow</a>, and may have received substantially more per order than other brokerages.
</p>
</div>
</div>

<div id="outline-container-org29b7982" class="outline-2">
<h2 id="org29b7982"><span class="section-number-2">5</span> <a href="https://en.wikipedia.org/wiki/Flesch%E2%80%93Kincaid_readability_tests">Reading Ease Score</a></h2>
<div class="outline-text-2" id="text-5">
<pre class="example">

"Flesch-Kincaid reading ease score: 73.36 Fairly easy (7th grade)"

</pre>

<pre class="example">

"Flesch-Kincaid grade level score: 6.55"

</pre>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Matt Brigida, Ph.D.</p>
<p class="date">Created: 2020-06-15 Mon 22:48</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
